# ПЕРЕИМЕНОВАТЬ: переменным требуется давать имена по смыслу, так чтобы код можно было удобнее и быстрее читать — имена a, b, c ничего не говорят о том, какие значения ассоциированы с данными переменными — вместо них стоило назвать переменные first_name, last_name, birth_year
a=input("Введите имя: ")
b=input("Введите фамилию: ")
c=input("Введите год рождения: ")
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишний пробел)
print(b,a,",",2024-int(c))
 
 
 #Иванова  Арина , 15


# ИТОГ: доработать — 1/2

