# ПЕРЕИМЕНОВАТЬ: переменным требуется давать имена по смыслу, так чтобы код можно было удобнее и быстрее читать — имена a, b, r, h, t ничего не говорят о том, какие значения ассоциированы с данными переменными — вместо них стоило назвать переменные integer, fractional, miles, km
a=input()
b=input()
# ИСПРАВИТЬ: вызовы функций str() избыточны, переменные a и b ссылаются на str объекты
r=float(str(a)+"."+str(b))
h=r*1.61
# КОММЕНТАРИЙ: если результат округления должен быть в дальнейшем использован как число, тогда имеет смысл использовать функцию round(); а в контексте данной задачи оптимальнее воспользоваться синтаксисом f-строк
t=round(h,1)
print(f"{r} миль = {t} км")


#15.7 миль = 25.3 км


# ИТОГ: хорошо — 4/5

