import utils
def main()-> None:
    text=input('текст сообщения: ')
    print(utils.important_message(text))
main()
   
#>>> текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ
#======================================================================#
#                                                                      #
#                          ЗАГОЛОВОК ПРОГРАММЫ                         #
#                                                                      #
#======================================================================#




    