import utils
def main()-> None:
    text=input('текст сообщения: ')
    print(utils.important_message(text))
main()
   
#>>> текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ
#====================================================================================================#
#                                                                                                    #
#                                        ЗАГОЛОВОК ПРОГРАММЫ                                         #
#                                                                                                    #
#====================================================================================================#

#>>> text='Обратите внимание на сообщение этой шедевральной программы от разработчиков, которые очень старались'
#>>> msg=utils.important_message(text)
#>>> print(msg)
#====================================================================================================#
#                                                                                                    #
#     Обратите внимание на сообщение этой шедевральной программы от разработчиков, которые очень     #
#                                             старались                                              #
#                                                                                                    #
#====================================================================================================#



    
